test/fixtures/payment_list_response.xml

<?xml version="1.0" encoding="utf-8"?>  
<response xmlns="http://www.freshbooks.com/api/" status="ok">  
  <payments page="1" per_page="10" pages="23" total="221">  
    <payment>  
      <payment_id>1</payment_id>  
      <invoice_id>1</invoice_id>  
      <date>2011-01-01 12:04:11</date>  
      <type>Cash</type>  
      <notes></notes>  
      <client_id>43</client_id>  
      <currency_code>CAD</currency_code> <!-- Only returned for credits -->  
      <updated>2009-08-12 09:00:00</updated>  
      <amount>301.21</amount>  
    </payment>  
    ...  
  </payments>  
</response>   
